examples_wave_flume/mesh_convergence_study/case3_regular/2CPH/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

turbk   0.000553383769275965;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.00000001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            inletOutlet;
        inletValue      uniform $turbk;
        value           uniform 0.00000001;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.00000001;
        value           uniform 0.00000001;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0.00000001;
        value           uniform 0.00000001;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.00000001;
    }
}


// ************************************************************************* //

